Tekla.Structures.CatalogInternal.ICDelegate
DO NOT USE! For internal usage only!

Tekla.Structures.CatalogInternal.ICDelegate.ExportEnumerateProfiles(Tekla.Structures.CatalogInternal.dotcatProfileItemEnumerator_t@)
DO NOT USE! For internal usage only!
pProfileEnumerator:
Returns:

Tekla.Structures.CatalogInternal.ICDelegate.ExportSelectProfileItem(Tekla.Structures.CatalogInternal.dotcatProfileItem_t@)
DO NOT USE! For internal usage only!
pProfileItem:
Returns:

Tekla.Structures.CatalogInternal.ICDelegate.ExportProfileItemToFile(Tekla.Structures.CatalogInternal.dotcatProfileItem_t@,System.String)
DO NOT USE! For internal usage only!
pProfileItem:
ExportFile:
Returns:

Tekla.Structures.CatalogInternal.ICDelegate.ExportProfileTreeToFile(Tekla.Structures.CatalogInternal.dotcatProfileTreePath_t@,System.String)
DO NOT USE! For internal usage only!
pProfileTreePath:
ExportFile:
Returns:

Tekla.Structures.CatalogInternal.ICDelegate.ExportGetParametricProfilePrefixFromSubtype(Tekla.Structures.CatalogInternal.dotcatProfileItem_t@)
DO NOT USE! For internal usage only!
pProfileItem:
Returns:

Tekla.Structures.CatalogInternal.ICDelegate.ExportGetProfileCrossSection(Tekla.Structures.CatalogInternal.dotcatCrossSection_t@)
DO NOT USE! For internal usage only!
pCrossSection:
Returns:

Tekla.Structures.CatalogInternal.ICDelegate.ExportCopyProfileItem(Tekla.Structures.CatalogInternal.dotcatProfileItem_t@,Tekla.Structures.CatalogInternal.dotcatProfileName_t@)
DO NOT USE! For internal usage only!
pProfileItem:
pNewName:
Returns:

Tekla.Structures.CatalogInternal.ICDelegate.ExportDeleteProfileItem(Tekla.Structures.CatalogInternal.dotcatProfileItem_t@)
DO NOT USE! For internal usage only!
pProfileItem:
Returns:

Tekla.Structures.CatalogInternal.ICDelegate.ExportModifyProfileItem(Tekla.Structures.CatalogInternal.dotcatProfileItem_t@)
DO NOT USE! For internal usage only!
pProfileItem:
Returns:

Tekla.Structures.CatalogInternal.ICDelegate.ExportSaveProfileDatabase
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.CatalogInternal.ICDelegate.ExportImportLibraryProfilesFromFolder(System.String)
DO NOT USE! For internal usage only!
Path:
Returns:

Tekla.Structures.CatalogInternal.ICDelegate.ExportInitializeImportProfilesFromFolder(Tekla.Structures.CatalogInternal.dotcatImportItem_t@,System.Collections.Generic.List{System.Object}@)
DO NOT USE! For internal usage only!
item:
pConflicts:
Returns:

Tekla.Structures.CatalogInternal.ICDelegate.ExportFinalizeImportProfilesFromFolder(System.Collections.Generic.List{System.Object}@)
DO NOT USE! For internal usage only!
pConflicts:
Returns:

Tekla.Structures.CatalogInternal.ICDelegate.ExportImportParametricProfilesFromFolder(System.String)
DO NOT USE! For internal usage only!
Path:
Returns:

Tekla.Structures.CatalogInternal.ICDelegate.ExportImportMaterialsFromFolder(System.String)
DO NOT USE! For internal usage only!
Path:
Returns:

Tekla.Structures.CatalogInternal.ICDelegate.ExportImportCustomComponentsFromPath(System.String)
DO NOT USE! For internal usage only!
Path:
Returns:

Tekla.Structures.CatalogInternal.ICDelegate.ExportImportRebarsFromFolder(System.String)
DO NOT USE! For internal usage only!
Path:
Returns:

Tekla.Structures.CatalogInternal.ICDelegate.ExportImportMeshesFromFolder(System.String)
DO NOT USE! For internal usage only!
Path:
Returns:

Tekla.Structures.CatalogInternal.ICDelegate.ExportImportBoltAssembliesFromFolder(System.String)
DO NOT USE! For internal usage only!
Path:
Returns:

Tekla.Structures.CatalogInternal.ICDelegate.ExportEnumerateMaterials(Tekla.Structures.CatalogInternal.dotcatMaterialItemEnumerator_t@)
DO NOT USE! For internal usage only!
pMaterialEnumerator:
Returns:

Tekla.Structures.CatalogInternal.ICDelegate.ExportSelectMaterialItem(Tekla.Structures.CatalogInternal.dotcatMaterialItem_t@)
DO NOT USE! For internal usage only!
pMaterialItem:
Returns:

Tekla.Structures.CatalogInternal.ICDelegate.ExportMaterialNameMaxLength
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.CatalogInternal.ICDelegate.ExportInsertMaterialItem(Tekla.Structures.CatalogInternal.dotcatMaterialItem_t@)
DO NOT USE! For internal usage only!
materialItem:
Returns:

Tekla.Structures.CatalogInternal.ICDelegate.ExportModifyMaterialItem(Tekla.Structures.CatalogInternal.dotcatMaterialItem_t@)
DO NOT USE! For internal usage only!
materialItem:
Returns:

Tekla.Structures.CatalogInternal.ICDelegate.ExportDeleteMaterialItem(Tekla.Structures.CatalogInternal.dotcatMaterialItem_t@)
DO NOT USE! For internal usage only!
pMaterialItem: The material item.
Returns:

Tekla.Structures.CatalogInternal.ICDelegate.ExportMaterialExists(Tekla.Structures.CatalogInternal.dotcatMaterialItem_t@)
DO NOT USE! For internal usage only!
pMaterialItem: The material item.
Returns:

Tekla.Structures.CatalogInternal.ICDelegate.ExportMaterialItemToFile(Tekla.Structures.CatalogInternal.dotcatMaterialItem_t@,System.String)
DO NOT USE! For internal usage only!
pMaterialItem:
ExportFile:
Returns:

Tekla.Structures.CatalogInternal.ICDelegate.ExportEnumerateBolts(Tekla.Structures.CatalogInternal.dotcatBoltItemEnumerator_t@)
DO NOT USE! For internal usage only!
pBoltEnumerator:
Returns:

Tekla.Structures.CatalogInternal.ICDelegate.ExportEnumerateBoltLengths(System.String,System.Double,System.Collections.Generic.List{System.Double}@)


Tekla.Structures.CatalogInternal.ICDelegate.ExportBoltAssemblyToFile(Tekla.Structures.CatalogInternal.dotcatBoltItemExport_t@)


Tekla.Structures.CatalogInternal.ICDelegate.ExportRebarToFile(Tekla.Structures.CatalogInternal.dotcatRebarItemExport_t@)


Tekla.Structures.CatalogInternal.ICDelegate.ExportMeshToFile(Tekla.Structures.CatalogInternal.dotcatMeshItemExport_t@)


Tekla.Structures.CatalogInternal.ICDelegate.EnumerateShapes(Tekla.Structures.CatalogInternal.dotcatShapeEnumerator_t@)
DO NOT USE! For internal usage only!
pShapeEnumerator:
Returns:

Tekla.Structures.CatalogInternal.ICDelegate.ExportEnumeratePrinters(Tekla.Structures.CatalogInternal.dotcatPrinterItemEnumerator_t@)
DO NOT USE! For internal usage only!
pPrinterEnumerator:
Returns:

Tekla.Structures.CatalogInternal.ICDelegate.ExportEnumerateComponents(Tekla.Structures.CatalogInternal.dotcatComponentItemEnumerator_t@)
DO NOT USE! For internal usage only!
pComponentEnumerator:
Returns:

Tekla.Structures.CatalogInternal.ICDelegate.ExportCustomComponentItemToFile(Tekla.Structures.CatalogInternal.dotcatComponentName_t@,System.String)
DO NOT USE! For internal usage only!
pComponentItem:
ExportFile:
Returns:

Tekla.Structures.CatalogInternal.ICDelegate.ExportShapeItemToFile(Tekla.Structures.CatalogInternal.dotcatShape_t@,System.String)
DO NOT USE! For internal usage only!
pShapeItem:
ExportFile:
Returns:

Tekla.Structures.CatalogInternal.ICDelegate.ExportEnumerateUserProperties(Tekla.Structures.CatalogInternal.dotcatUserPropertyItemEnumerator_t@)
DO NOT USE! For internal usage only!
pUserPropertyEnumerator:
Returns:

Tekla.Structures.CatalogInternal.ICDelegate.ExportInsertUserPropertyItem(Tekla.Structures.CatalogInternal.dotcatUserPropertyItem_t@)
DO NOT USE! For internal usage only!
pUserPropertyItem:
Returns:

Tekla.Structures.CatalogInternal.ICDelegate.ExportModifyUserPropertyItem(Tekla.Structures.CatalogInternal.dotcatUserPropertyItem_t@)
DO NOT USE! For internal usage only!
pUserPropertyItem:
Returns:

Tekla.Structures.CatalogInternal.ICDelegate.ExportDeleteUserPropertyItem(Tekla.Structures.CatalogInternal.dotcatUserPropertyItem_t@)
DO NOT USE! For internal usage only!
pUserPropertyItem:
Returns:

Tekla.Structures.CatalogInternal.ICDelegate.ExportSelectUserPropertyItem(Tekla.Structures.CatalogInternal.dotcatUserPropertyItem_t@)
DO NOT USE! For internal usage only!
pUserPropertyItem:
Returns:

Tekla.Structures.CatalogInternal.ICDelegate.ExportSelectUserPropertyItemObjectTypes(Tekla.Structures.CatalogInternal.dotcatUserPropertyItemObjectTypes_t@)
DO NOT USE! For internal usage only!
pUserPropertyItemObjectTypes:
Returns:

Tekla.Structures.CatalogInternal.ICDelegate.ExportUserPropertyItemObjectTypeOperation(Tekla.Structures.CatalogInternal.dotcatUserPropertyItemObjectTypeOperation_t@)
DO NOT USE! For internal usage only!
pUserPropertyItemObjectTypeOperation:
Returns:

Tekla.Structures.CatalogInternal.ICDelegate.ExportGetModelPath(System.String@)
Get path to the currently open model's directory
Path: The returned path
Returns: true (1) on success, false(0) otherwise

Tekla.Structures.CatalogInternal.ICDelegate.ImportShape(Tekla.Structures.CatalogInternal.dotcatShapeImport_t@,Tekla.Structures.CatalogInternal.dotcatShape_t@)
DO NOT USE! For internal usage only! Imports a shape
entry:
The entry containing the input of importing.
shape:
The shape output at importing success
Returns:
An error code.

Tekla.Structures.CatalogInternal.ICDelegate.SelectShape(Tekla.Structures.CatalogInternal.dotcatShape_t@)
DO NOT USE! For internal usage only! Select a shape.
vo: value object to pass data
Returns: true (1) on success, false(0) otherwise

Tekla.Structures.CatalogInternal.ICDelegate.DeleteShape(Tekla.Structures.CatalogInternal.dotcatShape_t@)
DO NOT USE! For internal usage only! Delete a shape.
vo: value object to pass data
Returns: true (1) on success, false(0) otherwise

Tekla.Structures.CatalogInternal.ICDelegate.InsertShape(Tekla.Structures.CatalogInternal.dotcatShape_t@,Tekla.Structures.CatalogInternal.dotcatShape_t@,System.Boolean)
DO NOT USE! For internal usage only! Insert a shape.
input: shape data for input
pResultShape: the resulting shape data from insert
AllowGeoDuplicates: set this to true if you want to allow insertion of shapes that
have a geometry that is identical to a pre-existing geometry for a shape in the catalog
Returns: true (1) on success, false(0) otherwise

Tekla.Structures.CatalogInternal.ICDelegate.ShapeExists(System.String)
DO NOT USE! For internal usage only! Checks if a shape exists
geohash:
The hash of the geometry
Returns:
Returns 1 on success, 0 otherwise

Tekla.Structures.CatalogInternal.ICDelegate.ShapeExistsByName(System.String)
DO NOT USE! For internal usage only! Checks if a shape exists by shape name
Name:
The name of the geometry
Returns:
Returns 1 on success, 0 otherwise

Tekla.Structures.CatalogInternal.ICDelegate.ModifyShape(Tekla.Structures.CatalogInternal.dotcatShape_t@,Tekla.Structures.CatalogInternal.dotcatShape_t@)
DO NOT USE! For internal usage only! Modify a shape.
input: input shape info
result: result from modify
Returns: true (1) on success, false(0) otherwise

Tekla.Structures.CatalogInternal.ICDelegate.CleanAndModifyShape(Tekla.Structures.CatalogInternal.dotcatShape_t@,Tekla.Structures.CatalogInternal.dotcatShapeCleanParams_t@,System.Boolean@)
DO NOT USE! For internal usage only! Clean and modify a shape.
pInput: input shape info
cleaningParams: cleaning parameters
pIsSolid: output value for solidity of shape, true if it is a solid
Returns: true (1) on success, false(0) otherwise

Tekla.Structures.CatalogInternal.ICDelegate.CleanAndModifyShapeByName(System.String,Tekla.Structures.CatalogInternal.dotcatShapeCleanParams_t@,System.Boolean@)
DO NOT USE! For internal usage only! Clean and modify a shape, do the selection by shape name.
name: The name, as in the Shape Catalog, of the shape to be cleaned
cleaningParams: cleaning parameters
isSolid: output value for solidity of shape, true if it is a solid
Returns: true (1) on success, false(0) otherwise

Tekla.Structures.CatalogInternal.ICDelegate.RenameShape(Tekla.Structures.CatalogInternal.dotcatShape_t@,System.String)
DO NOT USE! For internal usage only! Rename a shape.
input: input shape info
Name: New shape name
Returns: true (1) on success, false(0) otherwise

Tekla.Structures.CatalogInternal.ICDelegate.ShapeLocation(System.String)
DO NOT USE! For internal usage only! Get location of shape files.
Name: Shape name
Returns: Number indicating location of shape files on the disk.